package day0308.t6_interfaceEx;
/*
 장난감 가게에서 연령별로 각각에 대한 기능을 알아보는 프로그램을 만드시오?(인터페이스사용)
 (연령대를 입력하면 각 연령에 해당하는 장난감명과 기능을 모두 출력시켜주시오.)
 ----------------------------------------------------
 장난감  팔다리움직임		불빛발사기능	미사일발사기능	연령대
 ----------------------------------------------------
 곰돌이     o				x			x		 전체연령
 로보트     o				x			o		 5세이상만 가능
 비행기     x				o			o		 7세이상만 가능
 탱크      x				x			o		 10세이상만 가능
 ----------------------------------------------------
 
 연령대를 입력받아서 사용가능한 장난감의 기능만 조회되게 해야한다.
 */
public class ToyRun {

}
